In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import math
import warnings
warnings.filterwarnings("ignore")

In [2]:
#SERİLER
v = np.array([1,2,3,4,5,6,7])
s1 = pd.Series(v)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32

In [3]:
s1.dtype

dtype('int32')

In [4]:
s1.nbytes

28

In [5]:
s1.shape

(7,)

In [6]:
s1.count()

7

In [7]:
s0 = pd.Series([1,2,3], index = ['a','b','c'])

In [8]:
s0

a    1
b    2
c    3
dtype: int64

In [9]:
s1.index = ['a','b','c','d','e','f','g']
s1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int32

In [10]:
v2 = np.random.random(10)
ind2 = np.arange(0, 10)
s = pd.Series(v2, ind2)
v2, ind2, s

(array([0.24896123, 0.15661218, 0.74868083, 0.55473789, 0.51417613,
        0.17911948, 0.00101494, 0.35777612, 0.10046177, 0.40573153]),
 array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 0    0.248961
 1    0.156612
 2    0.748681
 3    0.554738
 4    0.514176
 5    0.179119
 6    0.001015
 7    0.357776
 8    0.100462
 9    0.405732
 dtype: float64)

In [11]:
dict1 = {'a1': 10, 'a2': 20, 'a3': 30, 'a4': 40}
s3 = pd.Series(dict1)
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [12]:
pd.Series(99, index = [0,1,2,3,4,5])

0    99
1    99
2    99
3    99
4    99
5    99
dtype: int64

In [13]:
s

0    0.248961
1    0.156612
2    0.748681
3    0.554738
4    0.514176
5    0.179119
6    0.001015
7    0.357776
8    0.100462
9    0.405732
dtype: float64

In [14]:
s[:]

0    0.248961
1    0.156612
2    0.748681
3    0.554738
4    0.514176
5    0.179119
6    0.001015
7    0.357776
8    0.100462
9    0.405732
dtype: float64

In [15]:
s[0:3]

0    0.248961
1    0.156612
2    0.748681
dtype: float64

In [16]:
s[-1:]

9    0.405732
dtype: float64

In [17]:
s[:-2]

0    0.248961
1    0.156612
2    0.748681
3    0.554738
4    0.514176
5    0.179119
6    0.001015
7    0.357776
dtype: float64

In [18]:
s[-3:-1]

7    0.357776
8    0.100462
dtype: float64

In [19]:
s1 = pd.Series([10,20,30])

In [20]:
s1

0    10
1    20
2    30
dtype: int64

In [21]:
s2 = s1.copy()

In [22]:
s2

0    10
1    20
2    30
dtype: int64

In [23]:
s3

a1    10
a2    20
a3    30
a4    40
dtype: int64

In [24]:
s4 = s2.append(s3)
s4

0     10
1     20
2     30
a1    10
a2    20
a3    30
a4    40
dtype: int64

In [25]:
s4.drop('a4', inplace = False)

0     10
1     20
2     30
a1    10
a2    20
a3    30
dtype: int64

In [26]:
s4

0     10
1     20
2     30
a1    10
a2    20
a3    30
a4    40
dtype: int64

In [27]:
s4.drop('a4', inplace = True)
s4

0     10
1     20
2     30
a1    10
a2    20
a3    30
dtype: int64

In [28]:
s4

0     10
1     20
2     30
a1    10
a2    20
a3    30
dtype: int64

In [30]:
s4 = s4.append(pd.Series({'a4': 7}))
s4

0     10
1     20
2     30
a1    10
a2    20
a3    30
a4     7
dtype: int64

In [31]:
v1 = np.array([10,20,30])
v2 = np.array([1,2,3])
s1 = pd.Series(v1)
s2 = pd.Series(v2)
s1, s2

(0    10
 1    20
 2    30
 dtype: int32,
 0    1
 1    2
 2    3
 dtype: int32)

In [32]:
s1.add(s2)

0    11
1    22
2    33
dtype: int32

In [33]:
s1.sub(s2)

0     9
1    18
2    27
dtype: int32

In [34]:
s1.subtract(s2)

0     9
1    18
2    27
dtype: int32

In [35]:
s1.add(9)

0    19
1    29
2    39
dtype: int32

In [36]:
s1.mul(s2)

0    10
1    40
2    90
dtype: int32

In [37]:
s1.multiply(s2)

0    10
1    40
2    90
dtype: int32

In [38]:
s1.multiply(1000)

0    10000
1    20000
2    30000
dtype: int32

In [39]:
s1.divide(s2)

0    10.0
1    10.0
2    10.0
dtype: float64

In [40]:
s1.div(s2)

0    10.0
1    10.0
2    10.0
dtype: float64

In [41]:
# max(), min(), mean(), median(), std()  BUNLARA BAK S1 VE S2 İÇİN HESAPLA!!!

In [42]:
s1.equals(s2)

False

In [43]:
s5 = pd.Series([1,1,2,2,3,3], index=[0,1,2,3,4,5])
s5

0    1
1    1
2    2
3    2
4    3
5    3
dtype: int64

In [44]:
s5.value_counts()

1    2
2    2
3    2
dtype: int64

In [45]:
#Dataframe ( Veri Çerçevesi)

In [46]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [49]:
lang = ['Java', 'Python', 'C', 'C++']
df = pd.DataFrame(lang)
df

        0
0    Java
1  Python
2       C
3     C++

In [50]:
rating = [1,2,3,4]
df[1] = rating # 1 isimli sutün oluşturma
df

        0  1
0    Java  1
1  Python  2
2       C  3
3     C++  4

In [51]:
df.columns = ['Language','Rating']
df

  Language  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4

In [52]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df2 = pd.DataFrame(data)
df3 = pd.DataFrame(data, index = ['row1','row2'], columns = ['a','b'])
df4 = pd.DataFrame(data, index = ['row1','row2'], columns = ['a','b','c'])
df5 = pd.DataFrame(data, index = ['row1','row2'], columns = ['a','b','c','d'])

In [53]:
df2

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [54]:
df3

      a   b
row1  1   2
row2  5  10

In [55]:
df4

      a   b     c
row1  1   2   NaN
row2  5  10  20.0

In [56]:
df5

      a   b     c   d
row1  1   2   NaN NaN
row2  5  10  20.0 NaN

In [57]:
dates = pd.date_range(start = '2022-05-20', end ='2022-05-26')
dates

DatetimeIndex(['2022-05-20', '2022-05-21', '2022-05-22', '2022-05-23',
               '2022-05-24', '2022-05-25', '2022-05-26'],
              dtype='datetime64[ns]', freq='D')

In [59]:
dates = pd.date_range('today', periods = 7)
dates

DatetimeIndex(['2022-05-20 21:16:02.822770', '2022-05-21 21:16:02.822770',
               '2022-05-22 21:16:02.822770', '2022-05-23 21:16:02.822770',
               '2022-05-24 21:16:02.822770', '2022-05-25 21:16:02.822770',
               '2022-05-26 21:16:02.822770'],
              dtype='datetime64[ns]', freq='D')

In [60]:
dates = pd.date_range(start = '2022-05-20', end ='2022-05-26')
dates

DatetimeIndex(['2022-05-20', '2022-05-21', '2022-05-22', '2022-05-23',
               '2022-05-24', '2022-05-25', '2022-05-26'],
              dtype='datetime64[ns]', freq='D')

In [61]:
M = np.random.random((7,7))
M

array([[0.84881021, 0.0930575 , 0.61094005, 0.68858328, 0.50151729,
        0.41525461, 0.10019298],
       [0.95693949, 0.03208781, 0.96949937, 0.89276718, 0.52419898,
        0.51795401, 0.23806165],
       [0.81285424, 0.42157086, 0.97608531, 0.44020056, 0.52113117,
        0.97314849, 0.89681631],
       [0.56584346, 0.65580196, 0.40697432, 0.63411379, 0.52101636,
        0.15349894, 0.39750103],
       [0.65886245, 0.46108682, 0.79827095, 0.36532517, 0.00292667,
        0.50491846, 0.31958148],
       [0.80294203, 0.1212385 , 0.88981035, 0.21775903, 0.39704805,
        0.07282679, 0.0527982 ],
       [0.924882  , 0.69206715, 0.16219373, 0.80460746, 0.91199987,
        0.97487951, 0.54749561]])

In [62]:
dframe = pd.DataFrame(M, index = dates)
dframe

,0,1,2,3,4,5,6
2022-05-20,0.848810,0.093057,0.610940,0.688583,0.501517,0.415255,0.100193
2022-05-21,0.956939,0.032088,0.969499,0.892767,0.524199,0.517954,0.238062
2022-05-22,0.812854,0.421571,0.976085,0.440201,0.521131,0.973148,0.896816
2022-05-23,0.565843,0.655802,0.406974,0.634114,0.521016,0.153499,0.397501
2022-05-24,0.658862,0.461087,0.798271,0.365325,0.002927,0.504918,0.319581
2022-05-25,0.802942,0.121239,0.889810,0.217759,0.397048,0.072827,0.052798
2022-05-26,0.924882,0.692067,0.162194,0.804607,0.912000,0.974880,0.547496

In [63]:
dframe.columns = ['C1','C2','C3','C4','C5','C6','C7']
dframe

,C1,C2,C3,C4,C5,C6,C7
2022-05-20,0.848810,0.093057,0.610940,0.688583,0.501517,0.415255,0.100193
2022-05-21,0.956939,0.032088,0.969499,0.892767,0.524199,0.517954,0.238062
2022-05-22,0.812854,0.421571,0.976085,0.440201,0.521131,0.973148,0.896816
2022-05-23,0.565843,0.655802,0.406974,0.634114,0.521016,0.153499,0.397501
2022-05-24,0.658862,0.461087,0.798271,0.365325,0.002927,0.504918,0.319581
2022-05-25,0.802942,0.121239,0.889810,0.217759,0.397048,0.072827,0.052798
2022-05-26,0.924882,0.692067,0.162194,0.804607,0.912000,0.974880,0.547496

In [64]:
dframe.dtypes

C1    float64
C2    float64
C3    float64
C4    float64
C5    float64
C6    float64
C7    float64
dtype: object

In [66]:
dframe.sort_values(by = 'C1')

,C1,C2,C3,C4,C5,C6,C7
2022-05-23,0.565843,0.655802,0.406974,0.634114,0.521016,0.153499,0.397501
2022-05-24,0.658862,0.461087,0.798271,0.365325,0.002927,0.504918,0.319581
2022-05-25,0.802942,0.121239,0.889810,0.217759,0.397048,0.072827,0.052798
2022-05-22,0.812854,0.421571,0.976085,0.440201,0.521131,0.973148,0.896816
2022-05-20,0.848810,0.093057,0.610940,0.688583,0.501517,0.415255,0.100193
2022-05-26,0.924882,0.692067,0.162194,0.804607,0.912000,0.974880,0.547496
2022-05-21,0.956939,0.032088,0.969499,0.892767,0.524199,0.517954,0.238062

In [67]:
dframe.sort_values(by = 'C1', ascending = False)

,C1,C2,C3,C4,C5,C6,C7
2022-05-21,0.956939,0.032088,0.969499,0.892767,0.524199,0.517954,0.238062
2022-05-26,0.924882,0.692067,0.162194,0.804607,0.912000,0.974880,0.547496
2022-05-20,0.848810,0.093057,0.610940,0.688583,0.501517,0.415255,0.100193
2022-05-22,0.812854,0.421571,0.976085,0.440201,0.521131,0.973148,0.896816
2022-05-25,0.802942,0.121239,0.889810,0.217759,0.397048,0.072827,0.052798
2022-05-24,0.658862,0.461087,0.798271,0.365325,0.002927,0.504918,0.319581
2022-05-23,0.565843,0.655802,0.406974,0.634114,0.521016,0.153499,0.397501

In [68]:
df

  Language  Rating
0     Java       1
1   Python       2
2        C       3
3      C++       4

In [69]:
del df['Rating']

In [70]:
df

  Language
0     Java
1   Python
2        C
3      C++

In [71]:
df5

      a   b     c   d
row1  1   2   NaN NaN
row2  5  10  20.0 NaN

In [72]:
df5.pop('c')

row1     NaN
row2    20.0
Name: c, dtype: float64

In [73]:
df5

      a   b   d
row1  1   2 NaN
row2  5  10 NaN

In [74]:
col1 = np.linspace(10, 100, 30)
col2 = np.random.randint(10, 100, 30)
df10 = pd.DataFrame({'C1': col1, 'C2': col2})
df10

            C1  C2
0    10.000000  79
1    13.103448  98
2    16.206897  41
3    19.310345  97
4    22.413793  33
5    25.517241  99
6    28.620690  82
7    31.724138  18
8    34.827586  60
9    37.931034  21
10   41.034483  18
11   44.137931  29
12   47.241379  81
13   50.344828  65
14   53.448276  42
15   56.551724  74
16   59.655172  78
17   62.758621  32
18   65.862069  19
19   68.965517  43
20   72.068966  30
21   75.172414  10
22   78.275862  59
23   81.379310  84
24   84.482759  47
25   87.586207  72
26   90.689655  30
27   93.793103  21
28   96.896552  95
29  100.000000  27

In [76]:
df10 = df10.drop([17,18,19], axis = 0)
df10

            C1  C2
0    10.000000  79
1    13.103448  98
2    16.206897  41
3    19.310345  97
4    22.413793  33
5    25.517241  99
6    28.620690  82
7    31.724138  18
8    34.827586  60
9    37.931034  21
10   41.034483  18
11   44.137931  29
12   47.241379  81
13   50.344828  65
14   53.448276  42
15   56.551724  74
16   59.655172  78
20   72.068966  30
21   75.172414  10
22   78.275862  59
23   81.379310  84
24   84.482759  47
25   87.586207  72
26   90.689655  30
27   93.793103  21
28   96.896552  95
29  100.000000  27

In [77]:
df10.drop([16], axis = 0, inplace = True)
df10

            C1  C2
0    10.000000  79
1    13.103448  98
2    16.206897  41
3    19.310345  97
4    22.413793  33
5    25.517241  99
6    28.620690  82
7    31.724138  18
8    34.827586  60
9    37.931034  21
10   41.034483  18
11   44.137931  29
12   47.241379  81
13   50.344828  65
14   53.448276  42
15   56.551724  74
20   72.068966  30
21   75.172414  10
22   78.275862  59
23   81.379310  84
24   84.482759  47
25   87.586207  72
26   90.689655  30
27   93.793103  21
28   96.896552  95
29  100.000000  27

In [78]:
df10.drop(df10.index[5], axis = 0, inplace = True)
df10

            C1  C2
0    10.000000  79
1    13.103448  98
2    16.206897  41
3    19.310345  97
4    22.413793  33
6    28.620690  82
7    31.724138  18
8    34.827586  60
9    37.931034  21
10   41.034483  18
11   44.137931  29
12   47.241379  81
13   50.344828  65
14   53.448276  42
15   56.551724  74
20   72.068966  30
21   75.172414  10
22   78.275862  59
23   81.379310  84
24   84.482759  47
25   87.586207  72
26   90.689655  30
27   93.793103  21
28   96.896552  95
29  100.000000  27

In [79]:
df10 = df10.iloc[3:,]
df10

            C1  C2
3    19.310345  97
4    22.413793  33
6    28.620690  82
7    31.724138  18
8    34.827586  60
9    37.931034  21
10   41.034483  18
11   44.137931  29
12   47.241379  81
13   50.344828  65
14   53.448276  42
15   56.551724  74
20   72.068966  30
21   75.172414  10
22   78.275862  59
23   81.379310  84
24   84.482759  47
25   87.586207  72
26   90.689655  30
27   93.793103  21
28   96.896552  95
29  100.000000  27

In [80]:
df10 = df10.iloc[:-4,]

In [81]:
df10

           C1  C2
3   19.310345  97
4   22.413793  33
6   28.620690  82
7   31.724138  18
8   34.827586  60
9   37.931034  21
10  41.034483  18
11  44.137931  29
12  47.241379  81
13  50.344828  65
14  53.448276  42
15  56.551724  74
20  72.068966  30
21  75.172414  10
22  78.275862  59
23  81.379310  84
24  84.482759  47
25  87.586207  72

In [82]:
df10 = df10.iloc[:13,]
df10

           C1  C2
3   19.310345  97
4   22.413793  33
6   28.620690  82
7   31.724138  18
8   34.827586  60
9   37.931034  21
10  41.034483  18
11  44.137931  29
12  47.241379  81
13  50.344828  65
14  53.448276  42
15  56.551724  74
20  72.068966  30

In [83]:
df10.index[df10['C2'] == 25].tolist()

[]

In [84]:
#df10.drop[df10['C2'] == 25, axis =, inplace]

In [85]:
dframe

,C1,C2,C3,C4,C5,C6,C7
2022-05-20,0.848810,0.093057,0.610940,0.688583,0.501517,0.415255,0.100193
2022-05-21,0.956939,0.032088,0.969499,0.892767,0.524199,0.517954,0.238062
2022-05-22,0.812854,0.421571,0.976085,0.440201,0.521131,0.973148,0.896816
2022-05-23,0.565843,0.655802,0.406974,0.634114,0.521016,0.153499,0.397501
2022-05-24,0.658862,0.461087,0.798271,0.365325,0.002927,0.504918,0.319581
2022-05-25,0.802942,0.121239,0.889810,0.217759,0.397048,0.072827,0.052798
2022-05-26,0.924882,0.692067,0.162194,0.804607,0.912000,0.974880,0.547496

In [86]:
dframe['2022-05-20': '2022-05-22']

,C1,C2,C3,C4,C5,C6,C7
2022-05-20,0.848810,0.093057,0.610940,0.688583,0.501517,0.415255,0.100193
2022-05-21,0.956939,0.032088,0.969499,0.892767,0.524199,0.517954,0.238062
2022-05-22,0.812854,0.421571,0.976085,0.440201,0.521131,0.973148,0.896816

In [87]:
dframe.loc[:,['C1','C7']]

                  C1        C7
2022-05-20  0.848810  0.100193
2022-05-21  0.956939  0.238062
2022-05-22  0.812854  0.896816
2022-05-23  0.565843  0.397501
2022-05-24  0.658862  0.319581
2022-05-25  0.802942  0.052798
2022-05-26  0.924882  0.547496

In [88]:
dframe.loc['2022-05-20': '2022-05-22',['C1','C7']]

                  C1        C7
2022-05-20  0.848810  0.100193
2022-05-21  0.956939  0.238062
2022-05-22  0.812854  0.896816

In [89]:
dframe[dframe['C1'] > 0.6]

,C1,C2,C3,C4,C5,C6,C7
2022-05-20,0.848810,0.093057,0.610940,0.688583,0.501517,0.415255,0.100193
2022-05-21,0.956939,0.032088,0.969499,0.892767,0.524199,0.517954,0.238062
2022-05-22,0.812854,0.421571,0.976085,0.440201,0.521131,0.973148,0.896816
2022-05-24,0.658862,0.461087,0.798271,0.365325,0.002927,0.504918,0.319581
2022-05-25,0.802942,0.121239,0.889810,0.217759,0.397048,0.072827,0.052798
2022-05-26,0.924882,0.692067,0.162194,0.804607,0.912000,0.974880,0.547496

In [90]:
dframe.iloc[0][0]

0.8488102076711604

In [91]:
dframe['C1'] = 888
dframe

             C1        C2        C3        C4        C5        C6        C7
2022-05-20  888  0.093057  0.610940  0.688583  0.501517  0.415255  0.100193
2022-05-21  888  0.032088  0.969499  0.892767  0.524199  0.517954  0.238062
2022-05-22  888  0.421571  0.976085  0.440201  0.521131  0.973148  0.896816
2022-05-23  888  0.655802  0.406974  0.634114  0.521016  0.153499  0.397501
2022-05-24  888  0.461087  0.798271  0.365325  0.002927  0.504918  0.319581
2022-05-25  888  0.121239  0.889810  0.217759  0.397048  0.072827  0.052798
2022-05-26  888  0.692067  0.162194  0.804607  0.912000  0.974880  0.547496

In [93]:
dframe.at[0:3, 'C6'] = 777
dframe

             C1        C2        C3        C4        C5          C6        C7
2022-05-20  888  0.093057  0.610940  0.688583  0.501517  777.000000  0.100193
2022-05-21  888  0.032088  0.969499  0.892767  0.524199  777.000000  0.238062
2022-05-22  888  0.421571  0.976085  0.440201  0.521131  777.000000  0.896816
2022-05-23  888  0.655802  0.406974  0.634114  0.521016    0.153499  0.397501
2022-05-24  888  0.461087  0.798271  0.365325  0.002927    0.504918  0.319581
2022-05-25  888  0.121239  0.889810  0.217759  0.397048    0.072827  0.052798
2022-05-26  888  0.692067  0.162194  0.804607  0.912000    0.974880  0.547496

In [94]:
dframe.iat[0, 2] = 33
dframe

             C1        C2         C3        C4        C5          C6        C7
2022-05-20  888  0.093057  33.000000  0.688583  0.501517  777.000000  0.100193
2022-05-21  888  0.032088   0.969499  0.892767  0.524199  777.000000  0.238062
2022-05-22  888  0.421571   0.976085  0.440201  0.521131  777.000000  0.896816
2022-05-23  888  0.655802   0.406974  0.634114  0.521016    0.153499  0.397501
2022-05-24  888  0.461087   0.798271  0.365325  0.002927    0.504918  0.319581
2022-05-25  888  0.121239   0.889810  0.217759  0.397048    0.072827  0.052798
2022-05-26  888  0.692067   0.162194  0.804607  0.912000    0.974880  0.547496

In [ ]:
dframe.a